chris-bc/wendigo/esp32/main/wendigo.c
/* Basic console example (esp_console_repl API)

   This example code is in the Public Domain (or CC0 licensed, at your option.)

   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/

#include "wendigo.h"
#include "common.h"
#include "freertos/idf_additions.h"
#include "wifi.h"
#include "bluetooth.h"
#include "status.h"
#include <driver/uart_vfs.h>
/* Required in order to disable command hints */
#include "linenoise/linenoise.h"

/*
 * We warn if a secondary serial console is enabled. A secondary serial console is always output-only and
 * hence not very useful for interactive console applications. If you encounter this warning, consider disabling
 * the secondary serial console in menuconfig unless you know what you are doing.
 */
#if SOC_USB_SERIAL_JTAG_SUPPORTED
#if !CONFIG_ESP_CONSOLE_SECONDARY_NONE
#warning "A secondary serial console is not useful when using the console component. Please disable it in menuconfig."
#endif
#endif

#define PROMPT_STR CONFIG_IDF_TARGET

/* Console command history can be stored to and loaded from a file.
 * The easiest way to do this is to use FATFS filesystem on top of
 * wear_levelling library.
 */
#if CONFIG_CONSOLE_STORE_HISTORY
    #define MOUNT_PATH "/data"
    #define HISTORY_PATH MOUNT_PATH "/history.txt"
#endif // CONFIG_STORE_HISTORY

/** Display command syntax when in interactive mode */
void display_syntax(char *command) {
    if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
        printf("Usage: %s ( %d | %d | %d )\n%d: %s\n%d: %s\n%d: %s\n", command, ACTION_DISABLE,
               ACTION_ENABLE, ACTION_STATUS, ACTION_DISABLE, STRING_DISABLE, ACTION_ENABLE,
               STRING_ENABLE, ACTION_STATUS, STRING_STATUS);
    }
}

/** Inform the caller of an invalid command
 *  Either by displaying the command syntax or sending a MSG_INVALID response
 */
void invalid_command(char *cmd, char *arg, char *syntax) {
    if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
        display_syntax(syntax);
    } else {
        send_response(cmd, arg, MSG_INVALID);
    }
}

/** Sends a `result` message corresponding to the command `cmd` with optional argument `arg` over UART
 *  unless interactive mode is enabled, in which case a more readable result is printed to the console.
 */
esp_err_t send_response(char *cmd, char *arg, MsgType result) {
    // TODO: Decide whether or not to keep this and refactor as appropriate
    // As I begin implementing the FZ side of Wendigo I'm reconsidering the
    // usefulness of the ACK/OK/INVALID/FAIL protocol. Disable these for now
    if (scanStatus[SCAN_INTERACTIVE] == ACTION_DISABLE) {
        return ESP_OK;
    }

    char resultMsg[17];
    bool isError = false;
    switch (result) {
        case MSG_ACK:
            isError = false;
            if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                strcpy(resultMsg, "Executing:");
            } else {
                strcpy(resultMsg, "ACK");
            }
            break;
        case MSG_OK:
            isError = false;
            if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                strcpy(resultMsg, "Success:");
            } else {
                strcpy(resultMsg, "OK");
            }
            break;
        case MSG_FAIL:
            isError = true;
            if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                strcpy(resultMsg, "Error Running");
            } else {
                strcpy(resultMsg, "FAIL");
            }
            break;
        case MSG_INVALID:
            isError = true;
            if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                strcpy(resultMsg, "Invalid Command:");
            } else {
                strcpy(resultMsg, "INVALID");
            }
            break;
        default:
            ESP_LOGE(TAG, "Invalid result type: %d\n", result);
            return ESP_ERR_INVALID_ARG;
    }
    /* To display the message we want to include 2 strings if arg is NULL, otherwise 3, and to order
       printf arguments resultMsg, cmd, arg for Interactive mode; cmd, arg, resultMsg for UART mode. */
    if (arg == NULL) {
        if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
            if (isError) {
                ESP_LOGE(TAG, "%s %s\n", resultMsg, cmd);
            } else {
                /* Not currently displaying non-error messages to interactive console */
                //ESP_LOGI(TAG, "%s %s\n", resultMsg, cmd);
            }
        } else {
            printf("%s %s\n", cmd, resultMsg);
        }
    } else {
        if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
            if (isError) {
                ESP_LOGE(TAG, "%s %s %s\n", resultMsg, cmd, arg);
            } else {
                /* Not currently displaying non-error messages to interactive console */
                //ESP_LOGI(TAG, "%s %s %s\n", resultMsg, cmd, arg);
            }
        } else {
            printf("%s %s %s\n", cmd, arg, resultMsg);
        }
    }
    return ESP_OK;
}

/** Command syntax is <command> <ActionType>, where ActionType :== 0 | 1 | 2 */
ActionType parseCommand(int argc, char **argv) {
    /* Validate the argument - Must be between 0 & 2 */
    if (argc != 2) {
        return ACTION_INVALID;
    }
    uint8_t action = strtol(argv[1], NULL, 10);
    if (strlen(argv[1]) == 1 && action < ACTION_INVALID) {
        return (ActionType)action;
    } else {
        return ACTION_INVALID;
    }
}

/** Tag syntax is t[ag] <MAC> <ActionType>, where ActionType :== 0 | 1 | 2 (or 3 for ACTION_INVALID) */
ActionType parse_command_tag(int argc, char **argv, esp_bd_addr_t addr) {
    if (argc != 3) {
        return ACTION_INVALID;
    }
    /* argv[1] must be a MAC/BDA - Check it has the right number of bytes
       (and won't buffer overflow etc).
    */
    if (((strlen(argv[1]) + 1) / 3) != ESP_BD_ADDR_LEN) {
        return ACTION_INVALID;
    }
    esp_err_t result = wendigo_string_to_bytes(argv[1], addr);
    if (result != ESP_OK) {
        return ACTION_INVALID;
    }
    /* argv[2] must contain a valid ActionType enum */
    uint8_t action = strtol(argv[2], NULL, 10);
    if (strlen(argv[2]) == 1 && action < ACTION_INVALID) {
        return (ActionType)action;
    } else {
        return ACTION_INVALID;
    }
}

