chris-bc/wendigo/esp32/main/wendigo.c
/** Sets Wendigo's logging output to the specified level.
 *  On launch all logging is disabled, to prevent logs being sent over the
 *  UART interface. This function is used to automatically enable/disable
 *  logging when Interactive Mode is started/stopped.
 */
void wendigo_set_logging(esp_log_level_t level) {
    esp_log_level_set(BLE_TAG, level);
    esp_log_level_set(BT_TAG, level);
    esp_log_level_set(TAG, level);
}

/** A generic function that is called by the command handlers for the HCI, BLE, WIFI and INTERACTIVE commands.
 *  Parses the command line to determine and perform the requested action, sending appropriate messages to the UART
 *  host throughout. If a command requires `radio` to be enabled or disabled the function pointer `enableFunction()`
 *  or `disableFunction` is executed. These functions must take no arguments and return esp_err_t (or int).
 */
esp_err_t enableDisableRadios(int argc, char **argv, uint8_t radio, esp_err_t (*enableFunction)(), esp_err_t (*disableFunction)()) {
    esp_err_t result = ESP_OK;
    if (radio >= SCAN_COUNT) {
        return ESP_ERR_INVALID_ARG;
    }
    ActionType action = parseCommand(argc, argv);
    if (action == ACTION_INVALID) {
        invalid_command(argv[0], argv[1], syntaxTip[radio]);
        result = ESP_ERR_INVALID_ARG;
    } else {
        /* Acknowledge the message */
        send_response(argv[0], argv[1], MSG_ACK);
        /* Is the radio being turned on, turned off, or queried? */
        switch (action) {
            case ACTION_DISABLE:
                if (scanStatus[radio] == ACTION_ENABLE) {
                    scanStatus[radio] = ACTION_DISABLE;
                    if (disableFunction != NULL) {
                        result = disableFunction();
                    }
                }
                break;
            case ACTION_ENABLE:
                if (scanStatus[radio] == ACTION_DISABLE) {
                    scanStatus[radio] = ACTION_ENABLE;
                    if (enableFunction != NULL) {
                        result = enableFunction();
                    }
                }
                break;
            case ACTION_STATUS:
                if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                    ESP_LOGI(TAG, "%s Scanning: %s\n", radioFullNames[radio], (scanStatus[radio] == ACTION_ENABLE)?STRING_ACTIVE:STRING_IDLE);
                } else {
                    printf("%s status %d\n", radioShortNames[radio], scanStatus[radio]);
                }
                break;
            default:
                invalid_command(argv[0], argv[1], syntaxTip[radio]);
                result = ESP_ERR_INVALID_ARG;
                break;
        }
    }
    /* Reply with MSG_OK or MSG_FAIL */
    MsgType reply = MSG_OK;
    if (result != ESP_OK) {
        reply = MSG_FAIL;
    }
    send_response(argv[0], argv[1], reply);
    return ESP_OK;
}

esp_err_t cmd_bluetooth(int argc, char **argv) {
    enableDisableRadios(argc, argv, SCAN_HCI, wendigo_bt_enable, wendigo_bt_disable);
    return ESP_OK;
}

esp_err_t cmd_ble(int argc, char **argv) {
    enableDisableRadios(argc, argv, SCAN_BLE, wendigo_ble_enable, wendigo_ble_disable);
    return ESP_OK;
}

esp_err_t cmd_wifi(int argc, char **argv) {
    enableDisableRadios(argc, argv, SCAN_WIFI_AP, wendigo_wifi_enable, wendigo_wifi_disable);
    /* This sets scanStatus[] - Don't need to call the enable/disable function again */
    enableDisableRadios(argc, argv, SCAN_WIFI_STA, NULL, NULL);
    return ESP_OK;
}

/** Get, set or update the WiFi channels included in channel hopping.
 * Syntax: c[hannel] [ ACTION ] (ChannelNum )*
 * ACTION :== SET | ADD | RM | RESET
 * If ACTION is not specified the default action is SET.
 */
esp_err_t cmd_channel(int argc, char **argv) {
    if (argc == 1) {
        return wendigo_get_channels();
    }
    /* Is an action specified? */
    ListAction action = LIST_COUNT;
    char *endPtr = NULL;
    uint8_t this_channel = strtol(argv[1], &endPtr, 10);
    if (this_channel == 0 && endPtr == argv[1]) {
        /* argv[1] could not be parsed to a number - Treat it as an action */
        if (!strcasecmp(argv[1], "ADD")) {
            action = LIST_ADD;
        } else if (!strcasecmp(argv[1], "RM")) {
            action = LIST_RM;
        } else if (!strcasecmp(argv[1], "SET")) {
            action = LIST_SET;
        } else if (!strcasecmp(argv[1], "RESET")) {
            action = LIST_RESET;
        } else {
            /* Invalid action specified */
            if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                ESP_LOGE(TAG, "ERROR: Invalid syntax. Usage: c[hannel] [ SET | ADD | RM | RESET ] (channelNum )*.");
            }
            return ESP_ERR_INVALID_ARG;
        }
    }
    /* Reset channels to default if RESET specified */
    if (action == LIST_RESET) {
        return wendigo_reset_channels();
    }
    /* Return an error if no channel list was provided */
    if (argc == 2 && action != LIST_COUNT) {
        if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
            ESP_LOGE(TAG, "Error: No channels specified. Usage: c[hannel] [ SET | ADD | RM | RESET ] (channelNum )*.");
        }
        return ESP_ERR_INVALID_ARG;
    }
    /* Convert argv[] to a uint8_t[], excluding argv[0] and only including
     * argv[1] if it was able to be parsed to a number. */
    uint8_t channel_len = argc - 2;
    if (this_channel != 0) {
        ++channel_len;
        action = LIST_SET; /* Set the default action if not specified as an argument */
    }
    uint8_t *channel_list = malloc(channel_len);
    uint8_t channel_count = 0;
    if (channel_list == NULL) {
        if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
            ESP_LOGE(TAG, "Failed to allocate %d bytes to store channel list.", channel_len);
        }
        return ESP_ERR_NO_MEM;
    }
    /* We've already parsed argv[1] so add it immediately if it's a channel number */
    if (this_channel != 0) {
        if (wendigo_is_valid_channel(this_channel)) {
            channel_list[channel_count++] = this_channel;
        }
    }
    /* Loop through the remaining arguments, adding valid channels to channel_list[] */
    for (uint8_t i = 2; i < argc; ++i) {
        // TODO: Is this cast always safe? Maybe I should check bounds before casting?
        this_channel = (uint8_t)strtol(argv[i], NULL, 10);
        if (wendigo_is_valid_channel(this_channel)) {
            channel_list[channel_count++] = this_channel;
        }
    }
    /* Call the appropriate handler in wifi.c */
    esp_err_t result = ESP_OK;
    switch (action) {
        case LIST_SET:
            result = wendigo_set_channels(channel_list, channel_count);
            break;
        case LIST_ADD:
            result = wendigo_add_channels(channel_list, channel_count);
            break;
        case LIST_RM:
            result = wendigo_rm_channels(channel_list, channel_count);
            break;
        default:
            /* Unreachable block */
            ESP_LOGE(TAG, "ERROR: Unreachable code reached in wendigo.c: cmd_channel().");
    }
    free(channel_list);
    if (result == ESP_ERR_NO_MEM) {
        ESP_LOGE(TAG, "ERROR: Insufficient memory to %s channels.", (action == LIST_SET) ? "set" : (action == LIST_ADD) ? "add" : "remove");
    }
    return result;
}

/** Get or change the MAC(s) associated with the ESP32.
 * Syntax: "macs [ <type> [ <mac> ] ]", where:
 *  * <type> is 1 for WiFi, 2 for Bluetooth, 5 for Base MAC
 *    (WiFi MAC is Base MAC + 1, Bluetooth is Base MAC + 2)
 *  * <mac> is a 6-byte array.
 * Returns ESP_OK when successful
 */
esp_err_t cmd_mac(int argc, char **argv) {
    /* Validate arguments:
     * * count <= 3 (e.g. mac 1 00:00:00:00:00:00)
     * * if count > 1, argv[1] must be < MACS_COUNT
     * * if count == 3, argv[2] must be a MAC
     */
    uint8_t interface = WENDIGO_MACS_COUNT;
    uint8_t *macBytes = NULL;
    if (argc > 3) {
        // TODO: Log error
        return ESP_ERR_INVALID_ARG;
    }
    if (argc > 1) {
        char *endPtr;
        interface = strtol(argv[1], &endPtr, 10);
        if (endPtr == argv[1] || (interface != WENDIGO_MAC_BASE &&
                interface != WENDIGO_MAC_WIFI &&
                interface != WENDIGO_MAC_BLUETOOTH)) {
            /* No number, or the wrong number, found */
            // TODO: Log error
            return ESP_ERR_INVALID_ARG;
        }
        if (argc == 3) {
            macBytes = malloc(sizeof(uint8_t) * MAC_BYTES);
            if (macBytes == NULL) {
                // TODO: Log error
                return outOfMemory();
            }
            if (wendigo_string_to_bytes(argv[2], macBytes) != ESP_OK) {
                // TODO: Error
                free(macBytes);
                return ESP_ERR_INVALID_ARG;
            }
        }
    }
    /* We've validated arguments, & retrieved interface and MAC as needed */
    esp_err_t result = ESP_OK;
    if (argc == 3) {
        /* Set the MAC for the specified interface(s) */
        ESP_LOGI(TAG, "Setting interface %d to %02x:%02x:%02x:%02x:%02x:%02x.",
            interface, macBytes[0], macBytes[1], macBytes[2], macBytes[3],
            macBytes[4], macBytes[5]);
        result = wendigo_set_mac(interface, macBytes);
        if (result == ESP_OK) {
            ESP_LOGI(TAG, "Changed ok");
        } else {
            ESP_LOGI(TAG, "Error %d: %s", result, esp_err_to_name(result));
        }
        free(macBytes);
    }
    /* Display MAC after changing as confirmation */
    result |= wendigo_display_mac();
    return result;
}

