chris-bc/wendigo/esp32/main/wendigo.c
/** The `status` command is intended to provide an overall picture of ESP32-Wendigo's current state:
 *  * Support for each radio
 *  * Scanning status for each radio
 *  * Compiled with Bluetooth UUID dictionary (CONFIG_DECODE_UUIDS)
 *  * Metrics of device caches
 */
esp_err_t cmd_status(int argc, char **argv) {
    if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
        display_status_interactive();
    } else {
        display_status_uart();
    }
    return ESP_OK;
}

esp_err_t cmd_version(int argc, char **argv) {
    char msg[17];
    snprintf(msg, sizeof(msg), "Wendigo v%s", WENDIGO_VERSION);
    send_response(argv[0], NULL, MSG_ACK);
    if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
        ESP_LOGI(TAG, "%s", msg);
    } else {
        /* Wait for the talking stick */
        if (xSemaphoreTake(uartMutex, portMAX_DELAY) == pdTRUE) {
            send_bytes((uint8_t *)msg, strlen(msg) + 1);
            send_end_of_packet();
            xSemaphoreGive(uartMutex);
        } else {
            // TODO: Log error
        }
    }
    send_response(argv[0], NULL, MSG_OK);
    return ESP_OK;
}

esp_err_t cmd_interactive(int argc, char **argv) {
    /* Enable or disable logging based on status of Interactive Mode */
    ActionType action = parseCommand(argc, argv);
    switch (action) {
        case ACTION_ENABLE:
            wendigo_set_logging(ESP_LOG_INFO);
            linenoiseSetDumbMode(0);
            ESP_LOGI(TAG, "Enabling Interactive Mode...Done.");
            break;
        case ACTION_DISABLE:
            linenoiseSetDumbMode(1);
            ESP_LOGI(TAG, "Disabling Interactive Mode...Done.");
            wendigo_set_logging(ESP_LOG_NONE);
            break;
        default:
            /* Do nothing for status */
            break;
    }
    enableDisableRadios(argc, argv, SCAN_INTERACTIVE, NULL, NULL);
    return ESP_OK;
}

/** Usage: t[ag] ( b[t] | w[ifi] ) <MAC> [ 0 | 1 | 2 ] */
esp_err_t cmd_tag(int argc, char **argv) {
    esp_err_t result = ESP_OK;
    esp_bd_addr_t addr;
    send_response(argv[0], argv[1], MSG_ACK);
    ActionType action = parse_command_tag(argc, argv, addr);
    if (action == ACTION_INVALID) {
        invalid_command(argv[0], argv[1], syntaxTip[SCAN_TAG]);
        result = ESP_ERR_INVALID_ARG;
    }
    if (result == ESP_OK) {
        /* Fetch the specified device */
        wendigo_device *device = retrieve_by_mac(addr);
        if (device == NULL) {
            if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                ESP_LOGE(TAG, "Failed to retrieve device %s\n", argv[2]);
            }
            invalid_command(argv[0], argv[1], syntaxTip[SCAN_TAG]);
            result = ESP_ERR_INVALID_ARG;
        }
        if (result == ESP_OK) {
            switch (action) {
                case ACTION_DISABLE:
                    device->tagged = false;
                    if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                        ESP_LOGI(TAG, "Device %s untagged", argv[2]);
                    }
                    break;
                case ACTION_ENABLE:
                    device->tagged = true;
                    if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                        ESP_LOGI(TAG, "Device %s tagged", argv[2]);
                    }
                    break;
                case ACTION_STATUS:
                    if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                        ESP_LOGI(TAG, "Device %s IS %stagged.", argv[2], (device->tagged)?"":"NOT ");
                    }
                    break;
                default:
                    invalid_command(argv[0], argv[1], syntaxTip[SCAN_TAG]);
                    result = ESP_ERR_INVALID_ARG;
                    break;
            }
        }
    }
    if (result == ESP_OK) {
        send_response(argv[0], argv[1], MSG_OK);
    } else {
        send_response(argv[0], argv[1], MSG_FAIL);
    }
    return ESP_OK;
}

esp_err_t cmd_focus(int argc, char **argv) {
    esp_err_t result = ESP_OK;
    ActionType action = parseCommand(argc, argv);
    if (action == ACTION_INVALID) {
        invalid_command(argv[0], argv[1], syntaxTip[SCAN_FOCUS]);
        return ESP_ERR_INVALID_ARG;
    }
    send_response(argv[0], argv[1], MSG_ACK);
    switch (action) {
        case ACTION_DISABLE:
            scanStatus[SCAN_FOCUS] = ACTION_DISABLE;
            /* Everything else should take care of itself */
            break;
        case ACTION_ENABLE:
            scanStatus[SCAN_FOCUS] = ACTION_ENABLE;
            break;
        case ACTION_STATUS:
            if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                ESP_LOGI(TAG, "Focus Mode: %s\n", (scanStatus[SCAN_FOCUS] == ACTION_ENABLE)?STRING_ACTIVE:STRING_IDLE);
            } else {
                printf("%s status %d\n", radioShortNames[SCAN_FOCUS], scanStatus[SCAN_FOCUS]);
            }
            break;
        default:
            invalid_command(argv[0], argv[1], syntaxTip[SCAN_FOCUS]);
            result = ESP_ERR_INVALID_ARG;
    }
    if (result == ESP_OK && action != ACTION_STATUS) {
        if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
            ESP_LOGI(TAG, "Focus Mode %s successfully.", (action == ACTION_ENABLE)?"enabled":(action == ACTION_DISABLE)?"disabled":"queried");
        } else {
            send_response(argv[0], argv[1], MSG_OK);
        }
    } else if (action != ACTION_STATUS) {
        if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
            ESP_LOGE(TAG, "Failed to %s Focus Mode.", (action == ACTION_ENABLE)?"enable":(action == ACTION_DISABLE)?"disable":"query");
        } else {
            send_response(argv[0], argv[1], MSG_FAIL);
        }
    }
    return result;
}

static void initialize_filesystem(void)
{
    static wl_handle_t wl_handle;
    const esp_vfs_fat_mount_config_t mount_config = {
            .max_files = 4,
            .format_if_mount_failed = true
    };
    esp_err_t err = esp_vfs_fat_spiflash_mount_rw_wl(MOUNT_PATH, "storage", &mount_config, &wl_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to mount FATFS (%s)", esp_err_to_name(err));
        return;
    }
}

